Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24F16KM204.h
#define _AMP1CON_SPDSEL_POSITION                 0x00000007
#define _AMP1CON_SPDSEL_MASK                     0x00000080
#define _AMP1CON_SPDSEL_LENGTH                   0x00000001

#define _AMP1CON_AMPSLP_POSITION                 0x0000000C
#define _AMP1CON_AMPSLP_MASK                     0x00001000
#define _AMP1CON_AMPSLP_LENGTH                   0x00000001

#define _AMP1CON_AMPSIDL_POSITION                0x0000000D
#define _AMP1CON_AMPSIDL_MASK                    0x00002000
#define _AMP1CON_AMPSIDL_LENGTH                  0x00000001

#define _AMP1CON_AMPEN_POSITION                  0x0000000F
#define _AMP1CON_AMPEN_MASK                      0x00008000
#define _AMP1CON_AMPEN_LENGTH                    0x00000001

#define _AMP1CON_PINSEL0_POSITION                0x00000000
#define _AMP1CON_PINSEL0_MASK                    0x00000001
#define _AMP1CON_PINSEL0_LENGTH                  0x00000001

#define _AMP1CON_PINSEL1_POSITION                0x00000001
#define _AMP1CON_PINSEL1_MASK                    0x00000002
#define _AMP1CON_PINSEL1_LENGTH                  0x00000001

#define _AMP1CON_PINSEL2_POSITION                0x00000002
#define _AMP1CON_PINSEL2_MASK                    0x00000004
#define _AMP1CON_PINSEL2_LENGTH                  0x00000001

#define _AMP1CON_NINSEL0_POSITION                0x00000003
#define _AMP1CON_NINSEL0_MASK                    0x00000008
#define _AMP1CON_NINSEL0_LENGTH                  0x00000001

#define _AMP1CON_NINSEL1_POSITION                0x00000004
#define _AMP1CON_NINSEL1_MASK                    0x00000010
#define _AMP1CON_NINSEL1_LENGTH                  0x00000001

#define _AMP1CON_NINSEL2_POSITION                0x00000005
#define _AMP1CON_NINSEL2_MASK                    0x00000020
#define _AMP1CON_NINSEL2_LENGTH                  0x00000001

#define _AMP2CON_PINSEL_POSITION                 0x00000000
#define _AMP2CON_PINSEL_MASK                     0x00000007
#define _AMP2CON_PINSEL_LENGTH                   0x00000003

#define _AMP2CON_NINSEL_POSITION                 0x00000003
#define _AMP2CON_NINSEL_MASK                     0x00000038
#define _AMP2CON_NINSEL_LENGTH                   0x00000003

#define _AMP2CON_SPDSEL_POSITION                 0x00000007
#define _AMP2CON_SPDSEL_MASK                     0x00000080
#define _AMP2CON_SPDSEL_LENGTH                   0x00000001

#define _AMP2CON_AMPSLP_POSITION                 0x0000000C
#define _AMP2CON_AMPSLP_MASK                     0x00001000
#define _AMP2CON_AMPSLP_LENGTH                   0x00000001

#define _AMP2CON_AMPSIDL_POSITION                0x0000000D
#define _AMP2CON_AMPSIDL_MASK                    0x00002000
#define _AMP2CON_AMPSIDL_LENGTH                  0x00000001

#define _AMP2CON_AMPEN_POSITION                  0x0000000F
#define _AMP2CON_AMPEN_MASK                      0x00008000
#define _AMP2CON_AMPEN_LENGTH                    0x00000001

#define _AMP2CON_PINSEL0_POSITION                0x00000000
#define _AMP2CON_PINSEL0_MASK                    0x00000001
#define _AMP2CON_PINSEL0_LENGTH                  0x00000001

#define _AMP2CON_PINSEL1_POSITION                0x00000001
#define _AMP2CON_PINSEL1_MASK                    0x00000002
#define _AMP2CON_PINSEL1_LENGTH                  0x00000001

#define _AMP2CON_PINSEL2_POSITION                0x00000002
#define _AMP2CON_PINSEL2_MASK                    0x00000004
#define _AMP2CON_PINSEL2_LENGTH                  0x00000001

#define _AMP2CON_NINSEL0_POSITION                0x00000003
#define _AMP2CON_NINSEL0_MASK                    0x00000008
#define _AMP2CON_NINSEL0_LENGTH                  0x00000001

#define _AMP2CON_NINSEL1_POSITION                0x00000004
#define _AMP2CON_NINSEL1_MASK                    0x00000010
#define _AMP2CON_NINSEL1_LENGTH                  0x00000001

#define _AMP2CON_NINSEL2_POSITION                0x00000005
#define _AMP2CON_NINSEL2_MASK                    0x00000020
#define _AMP2CON_NINSEL2_LENGTH                  0x00000001

#define _DAC1CON_DACREF_POSITION                 0x00000000
#define _DAC1CON_DACREF_MASK                     0x00000003
#define _DAC1CON_DACREF_LENGTH                   0x00000002

#define _DAC1CON_DACTSEL_POSITION                0x00000002
#define _DAC1CON_DACTSEL_MASK                    0x0000007C
#define _DAC1CON_DACTSEL_LENGTH                  0x00000005

#define _DAC1CON_DACOE_POSITION                  0x00000007
#define _DAC1CON_DACOE_MASK                      0x00000080
#define _DAC1CON_DACOE_LENGTH                    0x00000001

#define _DAC1CON_DACTRIG_POSITION                0x00000008
#define _DAC1CON_DACTRIG_MASK                    0x00000100
#define _DAC1CON_DACTRIG_LENGTH                  0x00000001

#define _DAC1CON_SRDIS_POSITION                  0x00000009
#define _DAC1CON_SRDIS_MASK                      0x00000200
#define _DAC1CON_SRDIS_LENGTH                    0x00000001

#define _DAC1CON_DACFM_POSITION                  0x0000000B
#define _DAC1CON_DACFM_MASK                      0x00000800
#define _DAC1CON_DACFM_LENGTH                    0x00000001

#define _DAC1CON_DACSLP_POSITION                 0x0000000C
#define _DAC1CON_DACSLP_MASK                     0x00001000
#define _DAC1CON_DACSLP_LENGTH                   0x00000001

#define _DAC1CON_DACSIDL_POSITION                0x0000000D
#define _DAC1CON_DACSIDL_MASK                    0x00002000
#define _DAC1CON_DACSIDL_LENGTH                  0x00000001

#define _DAC1CON_DACEN_POSITION                  0x0000000F
#define _DAC1CON_DACEN_MASK                      0x00008000
#define _DAC1CON_DACEN_LENGTH                    0x00000001

#define _DAC1CON_REFSEL0_POSITION                0x00000000
#define _DAC1CON_REFSEL0_MASK                    0x00000001
#define _DAC1CON_REFSEL0_LENGTH                  0x00000001

#define _DAC1CON_REFSEL1_POSITION                0x00000001
#define _DAC1CON_REFSEL1_MASK                    0x00000002
#define _DAC1CON_REFSEL1_LENGTH                  0x00000001

#define _DAC1CON_DACTSEL0_POSITION               0x00000002
#define _DAC1CON_DACTSEL0_MASK                   0x00000004
#define _DAC1CON_DACTSEL0_LENGTH                 0x00000001

#define _DAC1CON_DACTSEL1_POSITION               0x00000003
#define _DAC1CON_DACTSEL1_MASK                   0x00000008
#define _DAC1CON_DACTSEL1_LENGTH                 0x00000001

#define _DAC1CON_DACTSEL2_POSITION               0x00000004
#define _DAC1CON_DACTSEL2_MASK                   0x00000010
#define _DAC1CON_DACTSEL2_LENGTH                 0x00000001

#define _DAC1CON_DACTSEL3_POSITION               0x00000005
#define _DAC1CON_DACTSEL3_MASK                   0x00000020
#define _DAC1CON_DACTSEL3_LENGTH                 0x00000001

#define _DAC1CON_DACTSEL4_POSITION               0x00000006
#define _DAC1CON_DACTSEL4_MASK                   0x00000040
#define _DAC1CON_DACTSEL4_LENGTH                 0x00000001

#define _DAC2CON_DACREF_POSITION                 0x00000000
#define _DAC2CON_DACREF_MASK                     0x00000003
#define _DAC2CON_DACREF_LENGTH                   0x00000002

#define _DAC2CON_DACTSEL_POSITION                0x00000002
#define _DAC2CON_DACTSEL_MASK                    0x0000007C
#define _DAC2CON_DACTSEL_LENGTH                  0x00000005

